let initialState = {
    reportData: [
        {
            data:"04.10.19 \n" +
                "10:23",
            buf_solutions:"В1: № 2000460789536: pH 1.09\n" +
                "В2: № 2000460789536: pH 2.00\n" +
                "В3: № 2000460789536: pH 4.01\n" +
                "В4: № 2000460789536: pH 7.00\n" +
                "В5: № 2000460789536: pH 9.21",
            slope:98.7,
            offset:-0.3,
            user:"Иванов Генадий Петрович"},
        {
            data:"04.10.19 \n" +
                "10:23",
            buf_solutions:"В1: № 2000460789536: pH 1.09\n" +
                "В2: № 2000460789536: pH 2.00\n" +
                "В3: № 2000460789536: pH 4.01\n" +
                "В4: № 2000460789536: pH 7.00\n" +
                "В5: № 2000460789536: pH 9.21",
            slope:98.7,
            offset:-0.3,
            user:"Петров Иван Генадьевич"},
        {
            data:"04.10.19\n 10:23",
            buf_solutions:"В1: № 2000460789536: pH 1.09\n" +
                " В2: № 2000460789536: pH 2.00\n" +
                " В3: № 2000460789536: pH 4.01\n" +
                " В4: № 2000460789536: pH 7.00\n" +
                " В5: № 2000460789536: pH 9.21",
            slope:98.7,
            offset:-0.3,
            user:"Петров Генадий Иванович"},
        {
            data:"04.10.19 \n" +
                "10:23",
            buf_solutions:"В1: № 2000460789536: pH 1.09\n" +
                "В2: № 2000460789536: pH 2.00\n" +
                "В3: № 2000460789536: pH 4.01\n" +
                "В4: № 2000460789536: pH 7.00\n" +
                "В5: № 2000460789536: pH 9.21",
            slope:90.1,
            offset:-0.5,
            user:"Генадьев Иван Петрович"}
    ]
}
const reportReducer = (state = initialState, action) =>{
    switch (action.type) {
        default: return state;
    }
}

export default reportReducer;